cases/05_navier_stokes_equation/27_triangular_cavity_projection_Re200_hybrid80/N80/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    movingTop
    {
        type            patch;
        physicalType    patch;
        nFaces          8;
        startFace       10962;
    }
    rightWall
    {
        type            patch;
        physicalType    patch;
        nFaces          8;
        startFace       10970;
    }
    leftWall
    {
        type            patch;
        physicalType    patch;
        nFaces          8;
        startFace       10978;
    }
    front
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          7308;
        startFace       10986;
    }
    back
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          7308;
        startFace       18294;
    }
)

// ************************************************************************* //
