cases/05_navier_stokes_equation/27_triangular_cavity_projection_Re200_hybrid80/N80/constant/Ccy
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "constant";
    object      Ccy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
7308
(
-0.0359649122807
-0.0359649122807
-0.0359649122807
-0.0359649122807
-0.0359649122807
-0.0359649122807
-0.0359649122807
-0.0359649122807
...
)
;

boundaryField
{
    movingTop
    {
        type            calculated;
        value           uniform 0;
    }
    rightWall
    {
        type            calculated;
        value           nonuniform List<scalar> 8(-2.8125 -0.187499999999 -0.562499999998 -0.937499999996 -1.3125 -1.6875 -2.0625 -2.4375);
    }
    leftWall
    {
        type            calculated;
        value           nonuniform List<scalar> 8(-2.8125 -0.187500000001 -2.4375 -2.0625 -1.6875 -1.3125 -0.937500000003 -0.562500000002);
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
